10/data/attachments/6c55c5390e30a3d2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_335b587d-4b17-491c-beab-a5e09d5c7364</nif:username>
            <nif:friendToBeAdded>Marissa_race_Friend_40126_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>